In [1]:
#pip install datasets 
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset=load_dataset("lukebarousse/data_jobs")
df=dataset['train'].to_pandas()

df["job_posted_date"]=pd.to_datetime(df["job_posted_date"])

In [2]:
df.loc[:10 ,"salary_year_avg":"salary_hour_avg"]

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [5]:
median_salary_year=df["salary_year_avg"].median()

In [6]:
median_salary_hour=df["salary_hour_avg"].median()

In [8]:
df_filled=df
df_filled["salary_year_avg"]=df_filled["salary_year_avg"].fillna(median_salary_year)
df_filled["salary_hour_avg"]=df_filled["salary_hour_avg"].fillna(median_salary_hour)

df["sütun"].fillna(değer) burada değer yerine yazılan değer bizim null yazılan yerlere kendimizin değer vermesini sağlar bu yüzden oraya median değerini yazmak istediğimizde onu yazdırdık

In [9]:
df_filled.loc[:10 ,"salary_year_avg":"salary_hour_avg"]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [11]:
df_unique=df_filled
df_unique=df_unique.drop_duplicates()
print("length of original df:",len(df_filled))
print("length of unique df:",len(df_unique))
print("Rows Dropped:",len(df_filled)-len(df_unique))

length of original df: 785741
length of unique df: 785640
Rows Dropped: 101

In [13]:
df_unique=df_unique.drop_duplicates(subset=["job_title","company_name"])
print("length of original df:",len(df_filled))
print("length of unique df:",len(df_unique))
print("Rows Dropped:",len(df_filled)-len(df_unique))

length of original df: 785741
length of unique df: 508042
Rows Dropped: 277699